---
kind: other
id: Properties.T:Autodesk.Revit.DB.FaceArrayIterator
source: html/3f8de722-4836-e1e8-8b32-d99cd155486f.htm
---
# FaceArrayIterator Properties

Retrieves the item that is the current focus of the iterator.